<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [rabbitmq-discuss] Metric egress/ingress rates
   </TITLE>
   <LINK REL="Index" HREF="index.html" >
   <LINK REL="made" HREF="mailto:rabbitmq-discuss%40lists.rabbitmq.com?Subject=Re%3A%20%5Brabbitmq-discuss%5D%20Metric%20egress/ingress%20rates&In-Reply-To=%3C88C56380720FB647938FC81ECFD3267433A04AC7%40vlg-mail04.Megafon.ru%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="033716.html">
   <LINK REL="Next"  HREF="033717.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[rabbitmq-discuss] Metric egress/ingress rates</H1>
    <B>Vyacheslav Artyukhov</B> 
    <A HREF="mailto:rabbitmq-discuss%40lists.rabbitmq.com?Subject=Re%3A%20%5Brabbitmq-discuss%5D%20Metric%20egress/ingress%20rates&In-Reply-To=%3C88C56380720FB647938FC81ECFD3267433A04AC7%40vlg-mail04.Megafon.ru%3E"
       TITLE="[rabbitmq-discuss] Metric egress/ingress rates">Vyacheslav.Artyukhov at MegaFon.ru
       </A><BR>
    <I>Tue Feb 11 15:29:11 GMT 2014</I>
    <P><UL>
        <LI>Previous message: <A HREF="033716.html">[rabbitmq-discuss] Internal IP address conflict,	gives channel the same name
</A></li>
        <LI>Next message: <A HREF="033717.html">[rabbitmq-discuss] Metric egress/ingress rates
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#33715">[ date ]</a>
              <a href="thread.html#33715">[ thread ]</a>
              <a href="subject.html#33715">[ subject ]</a>
              <a href="author.html#33715">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Good day!

What does the metrics 'avg_ack_ingress_rate' and 'avg_ack_egress_rate' exactly means? I have an idle queue that has these metrics of values about '164'. I have no idea why..

________________________________

&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1083;&#1080;&#1094;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1086;&#1085;&#1072; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1085;&#1072;. &#1042; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1076;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1072; &#1080;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1072; &#1082;&#1077;&#1084;-&#1083;&#1080;&#1073;&#1086;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1090;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1090; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1087;&#1077;&#1088;&#1077;&#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;, &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1077;&#1075;&#1086; &#1095;&#1072;&#1089;&#1090;&#1080; &#1085;&#1077;&#1079;&#1072;&#1082;&#1086;&#1085;&#1085;&#1086; &#1080; &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1077;&#1085;&#1086;. &#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1080; &#1101;&#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1086;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1085;&#1077;&#1079;&#1072;&#1084;&#1077;&#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1077; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077;&#1083;&#1102; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1077; &#1089;&#1086; &#1074;&#1089;&#1077;&#1084; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1099;&#1084; &#1089;&#1072;&#1084;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1080; &#1083;&#1102;&#1073;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1077; &#1077;&#1075;&#1086; &#1082;&#1086;&#1087;&#1080;&#1080; &#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.

The information contained in this communication is intended solely for the use of the individual or entity to whom it is addressed and others authorized to receive it. It may contain confidential or legally privileged information. The contents may not be disclosed or used by anyone other than the addressee. If you are not the intended recipient(s), any use, disclosure, copying, distribution or any action taken or omitted to be taken in reliance on it is prohibited and may be unlawful. If you have received this communication in error please notify us immediately by responding to this email and then delete the e-mail and all attachments and any copies thereof.

(c)20mf50
-------------- next part --------------
An HTML attachment was scrubbed...
URL: &lt;<A HREF="http://lists.rabbitmq.com/pipermail/rabbitmq-discuss/attachments/20140211/38639ccb/attachment.html">http://lists.rabbitmq.com/pipermail/rabbitmq-discuss/attachments/20140211/38639ccb/attachment.html</A>&gt;
</PRE>





<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="033716.html">[rabbitmq-discuss] Internal IP address conflict,	gives channel the same name
</A></li>
	<LI>Next message: <A HREF="033717.html">[rabbitmq-discuss] Metric egress/ingress rates
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#33715">[ date ]</a>
              <a href="thread.html#33715">[ thread ]</a>
              <a href="subject.html#33715">[ subject ]</a>
              <a href="author.html#33715">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.rabbitmq.com/cgi-bin/mailman/listinfo/rabbitmq-discuss">More information about the rabbitmq-discuss
mailing list</a><br>
</body></html>
